<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Мовні ресурси для перевірки значень
    |--------------------------------------------------------------------------
    |
    | Наступні мовні рядки містять повідомлення за замовчуванням використовуються
    | класом, перевіряє значення (валідатором). Деякі з правил мають
    | кілька версій, наприклад, size. Ви можете поміняти їх на будь-які
    | інші, які краще підходять для вашої програми.
    |
    */
    'accepted' => 'Ви повинні прийняти :attribute.',
    'active_url' => 'Поле :attribute містить недійсний URL.',
    'after' => 'У полі :attribute повинна бути дата :date.',
    'after_or_equal' => 'У полі :attribute повинна бути дата після або дорівнювати :date.',
    'alpha' => 'Поле :attribute може містити тільки літери.',
    'alpha_dash' => 'Поле :attribute може містити тільки літери, цифри і дефіс.',
    'alpha_num' => 'Поле :attribute може містити тільки літери та цифри.',
    'array' => 'Поле :attribute повинно бути масивом.',
    'before' => 'У полі :attribute повинна бути дата до :date.',
    'before_or_equal' => 'У полі :attribute повинна бути дата до або дорівнювати :date.',
    'between' => [
        'numeric' => 'Поле :attribute повинно бути між :min і :max.',
        'file' => 'Розмір файлу в полі :attribute повинен бути між :min і :max Кілобайт(а).',
        'string' => 'Кількість символів в полі :attribute повинно бути між :min і :max.',
        'array' => 'Кількість елементів у полі :attribute повинно бути між :min і :max.',
    ],
    'boolean' => 'Поле :attribute повинно мати значення логічного типу.', // калька 'істина' або 'false' звучала б занадто неприродно
    'confirmed' => 'Поле :attribute не збігається з підтвердженням.',
    'date' => 'Поле :attribute не є датою.',
    'date_format' => 'Поле :attribute не відповідає формату :format.',
    'different' => 'Поля :attribute :other повинні розрізнятися.',
    'digits' => 'Довжина цифрового поля :attribute повинна бути :digits.',
    'digits_between' => 'Довжина цифрового поля :attribute повинна бути між :min і :max.',
    'dimensions' => 'Поле :attribute має неприпустимі розміри зображення.',
    'distinct' => 'Поле :attribute містить повторювані значення.',
    'email' => 'Поле :attribute має бути дійсним електронною адресою.',
    'file' => 'Поле :attribute повинно бути файлом.',
    'filled' => 'Поле :attribute обов\'язково для заповнення.',
    'exists' => 'Вибране значення для :attribute некоректно.',
    'image' => 'Поле :attribute повинно бути зображенням.',
    'in' => 'Вибране значення для :attribute помилково.',
    'in_array' => 'Поле :attribute не існує в :other.',
    'integer' => 'Поле :attribute повинно бути цілим числом.',
    'ip' => 'Поле :attribute має бути дійсним IP-адресою.',
    'ipv4' => 'Поле :attribute має бути дійсним IPv4-адресу.',
    'ipv6' => 'Поле :attribute має бути дійсним IPv6-адресу.',
    'json' => 'Поле :attribute повинно бути JSON рядком.',
    'max' => [
        'numeric' => 'Поле :attribute не може бути більше :max.',
        'file' => 'Розмір файлу в полі :attribute не може бути більше :max Кілобайт(а).',
        'string' => 'Кількість символів в полі :attribute не може перевищувати :max.',
        'array' => 'Кількість елементів у полі :attribute не може перевищувати :max.',
    ],
    'mimes' => 'Поле :attribute повинно бути файлом одного з наступних типів: :values.',
    'mimetypes' => 'Поле :attribute повинно бути файлом одного з наступних типів: :values.',
    'min' => [
        'numeric' => 'Поле :attribute повинно бути не менше :min.',
        'file' => 'Розмір файлу в полі :attribute повинен бути не менше :min Кілобайт(а).',
        'string' => 'Кількість символів в полі :attribute повинно бути не менше :min.',
        'array' => 'Кількість елементів у полі :attribute повинно бути не менше :min.',
    ],
    'not_in' => 'Вибране значення для :attribute помилково.',
    'numeric' => 'Поле :attribute повинна бути числом.',
    'present' => 'Поле :attribute має бути.',
    'regex' => 'Поле :attribute має помилковий формат.',
    'required' => 'Поле :attribute обов\'язково для заповнення.',
    'required_if' => 'Поле :attribute обов\'язково для заповнення, коли :other одно :value.',
    'required_unless' => 'Поле :attribute обов\'язково для заповнення, коли :other не одно :values.',
    'required_with' => 'Поле :attribute обов\'язково для заповнення, коли :values зазначено.',
    'required_with_all' => 'Поле :attribute обов\'язково для заповнення, коли :values зазначено.',
    'required_without' => 'Поле :attribute обов\'язково для заповнення, коли :values не зазначено.',
    'required_without_all' => 'Поле :attribute обов\'язково для заповнення, коли жодне з :values не зазначено.',
    'same' => 'Значення :attribute повинно збігатися з :other.',
    'size' => [
        'numeric' => 'Поле :attribute повинно бути рівним :size.',
        'file' => 'Розмір файлу в полі :attribute повинен бути дорівнює :size Кілобайт(а).',
        'string' => 'Кількість символів в полі :attribute повинно бути рівним :size.',
        'array' => 'Кількість елементів у полі :attribute повинно бути рівним :size.',
    ],
    'string' => 'Поле :attribute повинно бути рядком.',
    'timezone' => 'Поле :attribute має бути дійсним годинним поясом.',
    'unique' => 'Таке значення поля :attribute вже існує.',
    'uploaded' => 'Завантаження поля :attribute не вдалася.',
    'url' => 'Поле :attribute має помилковий формат.',
    /*
    |--------------------------------------------------------------------------
    | Власні мовні ресурси для перевірки значень
    |--------------------------------------------------------------------------
    |
    | Тут Ви можете вказати власні повідомлення для атрибутів.
    | Це дозволяє легко вказати своє повідомлення для заданого правила атрибута.
    |
    | http://laravel.com/docs/validation#custom-error-messages
    | Приклад використання
    |
    | 'custom' => [
    | 'email' => [
     | 'required' => 'Нам необхідно знати Вашу електронну адресу!',
    | ],
    | ],
    |
    */
    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],
    /*
    |--------------------------------------------------------------------------
    | Власні назви атрибутів
    |--------------------------------------------------------------------------
    |
    | Наступні рядки використовуються для підміни програмних імен елементів
     | користувальницького інтерфейсу на удобочитаемые. Наприклад, замість імені
    | поля "email" у повідомленнях буде виводитися "електронна адреса".
    |
    | Приклад використання
    |
    | 'attributes' => [
    | 'email' => 'адресу',
    | ],
    |
    */

    'attributes' => [
        'password' => 'пароль',
        'name' => 'ім\'я',

    ],

];