<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'Проектуйте' => 'Проектируйте',
    'Пропозиції' => 'Предложения',
    'Контакти' => 'Контакты',
    'Новини' => 'Новости',
    'Інтерєр' => 'Интерьер',
    'Меблі' => 'Мебель',
    'Корзина' => 'Корзина',
    'Вийти' => 'Выйти',
    'ДляАрхітекторів' => 'Для Архитекторов',
    'Авторизуйся' => 'Авторизуйся',
    'Прокомпанію' => 'О компании',
    'Пронас' => 'Про нас',
    'Головна' => 'Главная страница',

];
